{"pages":[{"title":"about","text":"이것 저것 기록용 블로그","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/02/16/hello-world/"},{"title":"general-hexo","text":"Hexo로 블로깅 하기Hexo 설치hexo https://hexo.io 12345npm install hexo-cli -ghexo init blogcd blognpm installhexo server 브라우져로 http://localhost:4000 열어서 보기 icarus 테마 설치하기123cd blognpm install hexo-theme-icarushexo config theme icarus github에 repository만들기… 블로그 참조 https://velog.io/@recordboy/%ED%97%A5%EC%86%8CHEXO%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%9C-%EA%B9%83%ED%97%88%EB%B8%8C-%EB%B8%94%EB%A1%9C%EA%B7%B8-%EB%A7%8C%EB%93%A4%EA%B8%B0","link":"/2021/02/16/general-hexo/"},{"title":"이미지보여라","text":"Hexo로 포스트 만들때 이미지 파일은 어디에 위치시키지?VS Code로 md파일 편집하기동기메일로 간단한 설정 문서를 보내고 싶은데 pdf양식으로 보내고 싶고내용중에는 xml도 있고 shell내용도 있으니 code formatting이 되면 좋겠는데 asciidoc은 복잡하고(maven 으로 가이드 문서 만들때 사용해봤지만…)Notion으로 하면 편한데. 무료 플랜이라 block을 다써서 PC에서 사용이 안되고 ㅠㅠmd파일 작성하고 pdf export하는 툴 찾아보니 제대로 안되거나 무료가 아니고 ㅠㅠ VS Code 좋네VS Code로 md파일 편집도 되고, Lint도 되고, Preview도 되고, pdf export도 되네. Cool Win + Shift + s 로 화면 캡처주로 글쓸때는 화면 캡처해서 올리는 경우가 많고 편하게 하려면Win10의 Win + Shift + s 버튼으로 화면 캡처하고클립보드에 저장된걸 바로 문서에 넣으면 편한데보통은 Win + v 로 붙여넣으면 신세계(카톡이나, word문서 등등) markdown-image Extenstionmd로 post만들때는 파일을 만들고 참조하도록 해야하니. 완전 귀찮은 상황 butVS Code에 extension이 있고 markdown-image Win + Shift +s로 화면 캡처, Ctrl + Alt + v 로 md문서에 붙여넣으면 파일 생성되고 이미지 태그 생성 좋네.. 하지만 github page로 올리면 이미지가 안나오네. hexo asset-foldershexo g (generate)해서 hexo d (deply)하면 이미지가 안나오네이것저것 찾아보다 공식 문서 hexo 문서asset folder설정대로 하니 성공. 12345_config.ymlpost_asset_folder: truemarked: prependRoot: true postAsset: true post폴더로 이미지파일 movehexo new로 post를 만들면 post이름으로 폴더가 생성되고그 폴더안에 이미지 파일을 넣어두면 잘 찾아지네(생성된 정적 html의 image link 경로를 날짜/post/ 이런식으로 맞춰줘서 되는듯) 그런데 VS Code에서 preview할때는 이미지가 안보이네. 흠.. toc도 잘나오나Front-mattertoc는 md문서의 윗 부분 (Front-matter) Front-matter는 파일 시작 시 작성하는 YAML 또는 JSON 구역입니다.게시물에 대한 환경 설정을 이 곳에서 합니다.Front-matter가 끝나는 부분은 YAML의 경우 세 개의 대시(-) 로, JSON의 경우 세 개의 세미콜론(;)을 넣어서 구분합니다. Front-Matter toc12345678post의 front-matter부분에 작성---title: 이미지보여라date: 2021-02-19 15:34:49tags: hexocategories: bloggingtoc: true--- icarus theme 설정그리고 hexo설정의 _config.icarus.yml파일의 wigets의 toc이 설정 1234567891011121314_config.icarus.yml 파일widgets: 생략# Table of contents widget configurations - # Where should the widget be placed, left sidebar or right sidebar position: left type: toc # Whether to show the index of each heading index: true # Whether to collapse sub-headings when they are out-of-view collapsed: true # Maximum level of headings to show (1-6) depth: 3","link":"/2021/02/19/%EC%9D%B4%EB%AF%B8%EC%A7%80%EB%B3%B4%EC%97%AC%EB%9D%BC/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"}],"categories":[{"name":"blogging","slug":"blogging","link":"/categories/blogging/"}]}